{
  "name": "Hi, I am Juan David",
  "profesion": "I am Full Stack Developer",
  "home": "Home",
  "about": "About me",
  "about-description": "Hello, my name is Juan David Hernández. I am a Full Stack Developer specialized in JavaScript, TypeScript, ReactJS and NodeJS, and I am from Colombia. I have more than two years of work experience as a full stack developer at ISANDA Innovative Software and Apps, where I have participated in important projects through outsourced contracts. These projects include a scheduling, search and chat system powered by artificial intelligence, as well as the development of a comprehensive platform for managing the customer journey. Additionally, I have over a year of experience developing student group projects for Academlo, a programming academy.",
  "about-hobbies": "In my free time, I enjoy reading in research fields. Professionally, I am passionate about exploring new technologies and trends in software development, which allows me to keep my knowledge up to date on the latest methodologies and technologies in the industry. On a personal level, I am fascinated by the cultural, social, religious, geographical and technological themes of universal history through all its stages. I like interacting with people and learning the most positive things each person has to offer. Additionally, I enjoy being part of work teams and contributing with my knowledge and ideas.",
  "projects": "Projects",
  "experience": "Experience",
  "contact": "Contact",
  "experience-preview-title": "My experience",
  "experience-preview-home": "I have more than two years of experience working as full stack developer at ISANDA Innovative Software company and Apps. During this time, I have participated in important projects through outsourced contracts.",
  "experience-option-1": "Support and Optimization of Software Development Projects.",
  "experience-option-2": "Creation of Web and Mobile Applications.",
  "experience-option-3": "Full Stack Project Development.",
  "experience-option-4": "API integration.",
  "experience-option-5": "Front-End and Back-End Development.",
  "experience-option-6": "Database Management.",
  "experience-option-7": "Security Implementation.",
  "experience-option-8": "Performance Optimization.",
  "experience-option-9": "Testing and Debugging.",
  "experience-option-10": "Deployment and Maintenance.",
  "experience-option-11": "Creation of Efficient Interfaces.",
  "experience-option-12": "Intuitive and Effective Design.",
  "experience-option-13": "Global State Management.",
  "experience-option-14": "Selection of Optimal Libraries and Bookstores.",
  "experience-description": "I have more than two years of experience working as a full stack developer at the company ISANDA Innovative Software and Apps. During this time, I have participated in important projects through outsourced contracts. Among them, I highlight my work in a company specialized in the development of virtual assistants based on artificial intelligence for home services. The solutions developed include scheduling, search and chat systems powered by artificial intelligence, which make it easier for companies to attract potential customers, respond to queries and manage appointments. Additionally, I have collaborated in the development of a comprehensive customer journey management platform, designed to improve the customer experience (CX) of companies. This platform offers features such as journey mapping, AI-based recommendations, data visualization, opportunity scoring, and collaboration tools. Throughout my career, I have performed various key functions to ensure the quality and efficiency of the projects I have worked on, such as:",
  "experience-conclusion": "These responsibilities have allowed me to develop a complete vision of the software development life cycle and the ability to create robust and efficient applications, handling both the development of the client and server side.",
  "experience-message": "check my experience",
  "contactme-message": "Contact me",
  "see-more-button": "See more",
  "modal-button": "Close",
  "see-cv": "See cv",
  "download-cv": "Download cv",
  "form-title": "Send me a message !",
  "form-button": "Send",
  "succes-alert": "Message sent successfully!",
  "error-alert": "Error sending message, please try again.",
  "name-label": "Name",
  "email-label": "Email",
  "message-label": "Message",
  "services-button-support": "Support and Optimization",
  "support-title": "Support and Optimization of Software Development Projects.",
  "support-description": "During my professional experience, I have performed various key functions to ensure the quality and efficiency of the projects I have worked on. My responsibilities included:",
  "support-option-1": "Bug correction: Detected during testing, both in functionality and design.",
  "support-option-2": "Code adjustments: Making adjustments to the code such as renaming variables, functions, changing methods according to the project architecture and SOLID principles.",
  "support-option-3": "Refactoring: Improving code readability and maintainability.",
  "support-option-4": "Implementation of new functionalities: Development and integration of new features according to the specified designs and requirements.",
  "support-option-5": "Improvement proposals: Suggestion of ideas to improve the performance and functionality of applications and websites by incorporating new technologies and libraries that optimize resources and time.",
  "support-conclusion": "These tasks have allowed me to develop a strong ability to solve technical problems, improve code efficiency, and contribute to the continuous evolution of applications.",
  "services-button-web-mobile": "Web and mobile applications",
  "web-mobile-title": "Creation of Web and Mobile Applications.",
  "web-mobile-description": "Throughout my career, I have participated in the development of both web and mobile applications, assuming various key responsibilities to ensure their success. Among the functions performed are:",
  "web-mobile-option-1": "Design and development: Creation of attractive and functional interfaces and user experience.",
  "web-mobile-option-2": "Improvement proposals: Suggestions to optimize the performance and functionality of applications by incorporating new technologies and libraries.",
  "web-mobile-option-3": "Collaboration and support: Working as a team to resolve technical issues and support ongoing project development.",
  "web-mobile-conclusion": "These functions have allowed me to acquire extensive experience in creating robust and efficient applications, adapted to the needs of the end user and aligned with the best practices of software development.",
  "services-button-fullstack": "Full stack projects",
  "fullstack-title": "Full Stack Project Development.",
  "fullstack-description": "In my professional career, I have worked in the comprehensive development of full stack projects, covering both the front-end and the back-end. My duties include:",
  "fullstack-option-1": "Front-end development: Creating intuitive and attractive user interfaces using technologies such as HTML, CSS, JavaScript and frameworks such as React.",
  "fullstack-option-2": "Back-end development: Implementation of server logic, databases and APIs using technologies such as Node.js, Express, or similar.",
  "fullstack-option-3": "APIS Integration: Connecting external systems and services to enrich the functionality of applications.",
  "fullstack-option-4": "Database management: Design and administration of relational and non-relational databases, ensuring integrity and efficiency in data management.",
  "fullstack-option-5": "Security implementation: Application of security measures to protect data and applications against possible threats and vulnerabilities.",
  "fullstack-option-6": "Performance Optimization: Performance and scalability improvements on both the front-end and back-end.",
  "fullstack-option-7": "Testing and debugging: Performing unit, integrated and system tests to ensure code quality and project functionality.",
  "fullstack-option-8": "Deployment and maintenance: Implementation of projects in production environments and provision of ongoing maintenance to ensure their correct operation.",
  "fullstack-conclusion": "These responsibilities have allowed me to develop a complete view of the software development lifecycle and the ability to create robust and efficient applications, handling both client-side and server-side development.",
  "front-title": "Front-End Development.",
  "front-description": "In my experience in front-end development, I have focused on creating efficient user interfaces and intuitive designs that improve user experience and optimize application performance. My responsibilities include:",
  "front-option-1": "Creating efficient interfaces: Development of applications with JavaScript and its React framework, using its hooks to manage state and effects efficiently.",
  "front-option-2": "Intuitive and effective design: Implementation of designs that facilitate navigation and usability, ensuring that users have a pleasant and frictionless experience.",
  "front-option-3": "Global state management: Using tools such as Redux or Context API to manage the global state of the application, ensuring fluid communication between components and effective state management.",
  "front-option-4": "Performance optimization: Application of techniques and practices to improve application efficiency, such as lazy loading, memoization, and code fragmentation.",
  "front-option-5": "Testing and debugging: Performing testing with libraries such as Jest and React Testing Library to ensure that components and functionalities work correctly and code quality is maintained.",
  "front-option-6": "Selection of optimal libraries and libraries: Use of the most appropriate and efficient libraries and libraries for each type of development.",
  "front-option-7": "Design collaboration: Working together with designers to transform wireframes and prototypes into functional and attractive interfaces.",
  "front-conclusion": "These features have allowed me to create front-end applications that are not only visually appealing but also highly efficient, ensuring optimal user experience and outstanding performance.",
  "back-title": "Back-End Development.",
  "back-description": "In my experience in back-end development, I have focused on creating lightweight and efficient code, optimizing response time on requests and saving resources. My responsibilities include:",
  "back-option-1": "Development with Node.js and Express: Creating applications and back-end services using Node.js and the Express framework to build fast and efficient APIs.",
  "back-option-2": "Performance optimization: Implementation of techniques to improve efficiency and reduce response time for requests, ensuring optimal use of server resources.",
  "back-option-3": "Security and access: Use of various libraries to guarantee the security of applications, including the implementation of access levels and data encryption. Tools and libraries used include bcrypt for password encryption, JWT (JSON Web Tokens) for authentication and authorization, and helmet to improve the security of Express applications.",
  "back-option-4": "Database management: Management of SQL databases, such as MySQL and PostgreSQL, ensuring integrity and performance in data management. Also, management of NoSQL databases such as MongoDB for applications that require flexibility and scalability in data storage.",
  "back-option-5": "Efficiency in data management: Use of query optimization techniques and proper index configuration to ensure that database operations are fast and efficient.",
  "back-option-6": "Testing and debugging: Carrying out unit and integration tests to ensure the quality of the code and the correct functioning of the implemented functionalities.",
  "back-option-7": "Collaboration and support: Teamwork with other developers and stakeholders to ensure that project requirements are met and that applications run smoothly and securely in production environments.",
  "back-conclusion": "These functions have allowed me to develop robust and scalable back-end applications, guaranteeing outstanding performance and high security in data handling and operations.",
  "hobbies-history-title": "Universal history",
  "hobbies-history-description": "Universal history, world history, world history or history of humanity is the set of facts and processes that have developed around human beings, from their appearance to the present.",
  "hobbies-reading-title": "Reading",
  "hobbies-reading-description": "Reading is a process in which an individual learns certain information through visual or written language.",
  "hobbies-investigation-title": "Investigation",
  "hobbies-investigation-description": "Research is understood as a set of human activities aimed at obtaining new knowledge and/or its application to the resolution of specific problems or existential questions."
}
