{
  "name": "Hola, soy Juan David",
  "profesion": "Soy desarrollador Full Stack",
  "home": "Inicio",
  "about": "Acerca de mi",
  "about-description": "Hola, mi nombre es Juan David Hernández. Soy Full Stack Developer especializado en JavaScript, TypeScript, ReactJS y NodeJS, y soy de Colombia. Cuento con más de dos años de experiencia laboral como desarrollador full stack en ISANDA Innovative Software and Apps, donde he participado en proyectos importantes a través de contratos tercerizados. Entre estos proyectos se destacan un sistema de programación, búsqueda y chat impulsado por inteligencia artificial, así como el desarrollo de una plataforma integral para la gestión del recorrido del cliente. Además, tengo más de un año de experiencia en el desarrollo de proyectos grupales estudiantiles para Academlo, una academia de programación.",
  "about-hobbies": "En mi tiempo libre, disfruto de la lectura en ámbitos investigativos. En el ámbito profesional, me apasiona explorar nuevas tecnologías y tendencias en el desarrollo de software, lo que me permite mantener mis conocimientos actualizados sobre las últimas metodologías y tecnologías de la industria. En el ámbito personal, me fascinan los temas culturales, sociales, religiosos, geográficos y tecnológicos de la historia universal a través de todas sus etapas.Me gusta interactuar con la gente y aprender lo más positivo que cada persona tiene para ofrecer. Además, disfruto siendo parte de equipos de trabajo y contribuyendo con mis conocimientos e ideas.",
  "projects": "Proyectos",
  "experience": "Experiencia",
  "contact": "Contacto",
  "experience-preview-title": "Mi experiencia",
  "experience-preview-home": "Cuento con más de dos años de experiencia trabajando como desarrollador full stack en la compañía ISANDA Innovative Software and Apps. Durante este tiempo, he participado en importantes proyectos a través de contratos tercerizados.",
  "experience-option-1": "Soporte y Optimización de Proyectos de Desarrollo de Software.",
  "experience-option-2": "Creación de Aplicaciones Web y Móviles.",
  "experience-option-3": "Desarrollo de Proyectos Full Stack.",
  "experience-option-4": "Integración de APIs.",
  "experience-option-5": "Desarrollo Front-End y Back-End.",
  "experience-option-6": "Gestión de Bases de Datos.",
  "experience-option-7": "Implementación de Seguridad.",
  "experience-option-8": "Optimización del Rendimiento.",
  "experience-option-9": "Pruebas y Depuración.",
  "experience-option-10": "Despliegue y Mantenimiento.",
  "experience-option-11": "Creación de Interfaces Eficientes.",
  "experience-option-12": "Diseño Intuitivo y Eficaz.",
  "experience-option-13": "Gestión del Estado Global.",
  "experience-option-14": "Selección de Bibliotecas y Librerías Óptimas.",
  "experience-description": "Cuento con más de dos años de experiencia trabajando como desarrollador full stack en la compañía ISANDA Innovative Software and Apps. Durante este tiempo, he participado en importantes proyectos a través de contratos tercerizados. Entre ellos, destaco mi trabajo en una empresa especializada en el desarrollo de asistentes virtuales basados en inteligencia artificial para servicios a domicilio. Las soluciones desarrolladas incluyen sistemas de programación, búsqueda y chat impulsados por inteligencia artificial, que facilitan a las empresas la captación de clientes potenciales, la respuesta a consultas y la gestión de citas. Además, he colaborado en el desarrollo de una plataforma integral de gestión del recorrido del cliente, diseñada para mejorar la experiencia del cliente (CX) de las empresas. Esta plataforma ofrece funciones como mapeo de viajes, recomendaciones basadas en inteligencia artificial, visualización de datos, puntuación de oportunidades y herramientas de colaboración. A lo largo de mi carrera, he desempeñado diversas funciones clave para asegurar la calidad y eficiencia de los proyectos en los que he trabajado, tales como:",
  "experience-conclusion": "Estas responsabilidades me han permitido desarrollar una visión completa del ciclo de vida del desarrollo de software y la capacidad de crear aplicaciones robustas y eficientes, manejando tanto el desarrollo del lado del cliente como del servidor.",
  "experience-message": "comprueba mi experiencia",
  "contactme-message": "Contactame",
  "see-more-button": "Ver mas",
  "modal-button": "Cerrar",
  "see-cv": "Ver cv",
  "download-cv": "Descargar cv",
  "form-title": "Enviame un mensaje !",
  "form-button": "Enviar",
  "succes-alert": "Mensaje enviado con éxito!",
  "error-alert": "Error al enviar el mensaje, inténtalo de nuevo.",
  "name-label": "Nombre",
  "email-label": "Correo",
  "message-label": "Mensaje",
  "services-button-support": "Soporte y Optimización",
  "support-title": "Soporte y Optimización de Proyectos de Desarrollo de Software.",
  "support-description": "Durante mi experiencia profesional, he desempeñado diversas funciones clave para garantizar la calidad y eficiencia de los proyectos en los que he trabajado. Mis responsabilidades incluyeron:",
  "support-option-1": "Corrección de bugs: Detectados durante el testeo, tanto en funcionalidades como en diseño.",
  "support-option-2": "Ajustes de código: Realización de ajustes en el código como renombrar variables, funciones, cambiar métodos según la arquitectura del proyecto y los principios SOLID.",
  "support-option-3": "Refactorización: Mejora de la legibilidad y mantenibilidad del código",
  "support-option-4": "Implementación de nuevas funcionalidades: Desarrollo e integración de nuevas características según los diseños y requisitos especificados.",
  "support-option-5": "Propuestas de mejora: Sugerencia de ideas para mejorar el rendimiento y funcionalidad de aplicaciones y sitios web mediante la incorporación de nuevas tecnologías y bibliotecas que optimicen recursos y tiempo.",
  "support-conclusion": "Estas tareas me han permitido desarrollar una sólida capacidad para resolver problemas técnicos, mejorar la eficiencia del código y contribuir a la evolución continua de las aplicaciones.",
  "services-button-web-mobile": "Aplicaciones web y mobile",
  "web-mobile-title": "Creación de Aplicaciones Web y Móviles.",
  "web-mobile-description": "A lo largo de mi carrera, he participado en el desarrollo de aplicaciones tanto web como móviles, asumiendo diversas responsabilidades clave para asegurar su éxito. Entre las funciones realizadas se encuentran:",
  "web-mobile-option-1": "Diseño y desarrollo: Creación de interfaces y experiencia de usuario atractivas y funcionales.",
  "web-mobile-option-2": "Propuestas de mejora: Sugerencias para optimizar el rendimiento y la funcionalidad de las aplicaciones mediante la incorporación de nuevas tecnologías y bibliotecas.",
  "web-mobile-option-3": "Colaboración y soporte: Trabajando en equipo para resolver problemas técnicos y apoyar el desarrollo continuo del proyecto.",
  "web-mobile-conclusion": "Estas funciones me han permitido adquirir una amplia experiencia en la creación de aplicaciones robustas y eficientes, adaptadas a las necesidades del usuario final y alineadas con las mejores prácticas del desarrollo de software.",
  "services-button-fullstack": "Proyectos full stack",
  "fullstack-title": "Desarrollo de Proyectos Full Stack.",
  "fullstack-description": "En mi trayectoria profesional, he trabajado en el desarrollo integral de proyectos full stack, abarcando tanto el front-end como el back-end. Mis funciones incluyen:",
  "fullstack-option-1": "Desarrollo front-end: Creación de interfaces de usuario intuitivas y atractivas utilizando tecnologías como HTML, CSS, JavaScript y frameworks como React.",
  "fullstack-option-2": "Desarrollo back-end: Implementación de la lógica del servidor, bases de datos y API utilizando tecnologías como Node.js, Express, o similares.",
  "fullstack-option-3": "Integración de APIS: Conexión de sistemas y servicios externos para enriquecer la funcionalidad de las aplicaciones.",
  "fullstack-option-4": "Gestión de bases de datos: Diseño y administración de bases de datos relacionales y no relacionales, asegurando la integridad y eficiencia en el manejo de datos.",
  "fullstack-option-5": "Implementación de seguridad: Aplicación de medidas de seguridad para proteger datos y aplicaciones contra posibles amenazas y vulnerabilidades.",
  "fullstack-option-6": "Optimización del rendimiento: Mejoras en el rendimiento y la escalabilidad tanto en el front-end como en el back-end.",
  "fullstack-option-7": "Pruebas y depuración: Realización de pruebas unitarias, integradas y de sistema para asegurar la calidad del código y la funcionalidad del proyecto.",
  "fullstack-option-8": "Despliegue y mantenimiento: Implementación de proyectos en entornos de producción y provisión de mantenimiento continuo para asegurar su correcto funcionamiento.",
  "fullstack-conclusion": "Estas responsabilidades me han permitido desarrollar una visión completa del ciclo de vida del desarrollo de software y la capacidad de crear aplicaciones robustas y eficientes, manejando tanto el desarrollo del lado del cliente como del servidor.",
  "front-title": "Desarrollo Front-End.",
  "front-description": "En mi experiencia en el desarrollo front-end, me he enfocado en crear interfaces de usuario eficientes y diseños intuitivos que mejoren la experiencia del usuario y optimicen el rendimiento de las aplicaciones. Mis responsabilidades incluyen:",
  "front-option-1": "Creación de interfaces eficientes: Desarrollo de aplicaciones con JavaScript y su framework React, utilizando sus hooks para gestionar el estado y los efectos de manera eficiente.",
  "front-option-2": "Diseño intuitivo y eficaz: Implementación de diseños que faciliten la navegación y usabilidad, garantizando que los usuarios tengan una experiencia agradable y sin fricciones.",
  "front-option-3": "Gestión del estado global: Uso de herramientas como Redux o Context API para gestionar el estado global de la aplicación, asegurando una comunicación fluida entre los componentes y un manejo eficaz del estado.",
  "front-option-4": "Optimización del rendimiento: Aplicación de técnicas y prácticas para mejorar la eficiencia de las aplicaciones, como el lazy loading, la memoización y la fragmentación de código.",
  "front-option-5": "Pruebas y depuración: Realización de pruebas de testing con bibliotecas como Jest y React Testing Library para asegurar que los componentes y funcionalidades trabajen correctamente y se mantenga la calidad del código.",
  "front-option-6": "Selección de bibliotecas y librerías óptimas: Utilización de las bibliotecas y librerías más adecuadas y eficientes para cada tipo de desarrollo.",
  "front-option-7": "Colaboración en el diseño: Trabajo conjunto con diseñadores para transformar wireframes y prototipos en interfaces funcionales y atractivas.",
  "front-conclusion": "Estas funciones me han permitido crear aplicaciones front-end que no solo son visualmente atractivas, sino también altamente eficientes, asegurando una experiencia de usuario óptima y un rendimiento sobresaliente.",
  "back-title": "Desarrollo Back-End.",
  "back-description": "En mi experiencia en el desarrollo back-end, me he centrado en crear código ligero y eficiente, optimizando el tiempo de respuesta en las peticiones y ahorrando recursos. Mis responsabilidades incluyen:",
  "back-option-1": "Desarrollo con Node.js y Express: Creación de aplicaciones y servicios back-end utilizando Node.js y el framework Express para construir APIs rápidas y eficientes.",
  "back-option-2": "Optimización del rendimiento: Implementación de técnicas para mejorar la eficiencia y reducir el tiempo de respuesta en las peticiones, asegurando un uso óptimo de los recursos del servidor.",
  "back-option-3": "Seguridad y acceso: Uso de diversas bibliotecas para garantizar la seguridad de las aplicaciones, incluyendo la implementación de niveles de acceso y encriptación de datos. Herramientas y librerías utilizadas incluyen bcrypt para encriptación de contraseñas, JWT (JSON Web Tokens) para autenticación y autorización, y helmet para mejorar la seguridad de las aplicaciones Express.",
  "back-option-4": "Gestión de bases de datos: Manejo de bases de datos SQL, como MySQL y PostgreSQL, asegurando integridad y rendimiento en la gestión de datos. También, manejo de bases de datos NoSQL como MongoDB para aplicaciones que requieren flexibilidad y escalabilidad en el almacenamiento de datos.",
  "back-option-5": "Eficiencia en el manejo de datos: Uso de técnicas de optimización de consultas y configuración adecuada de índices para asegurar que las operaciones de bases de datos sean rápidas y eficientes.",
  "back-option-6": "Pruebas y depuración: Realización de pruebas unitarias y de integración para asegurar la calidad del código y el correcto funcionamiento de las funcionalidades implementadas.",
  "back-option-7": "Colaboración y soporte: Trabajo en equipo con otros desarrolladores y stakeholders para asegurar que los requisitos del proyecto sean cumplidos y que las aplicaciones funcionen de manera fluida y segura en entornos de producción.",
  "back-conclusion": "Estas funciones me han permitido desarrollar aplicaciones back-end robustas y escalables, garantizando un rendimiento sobresaliente y una alta seguridad en el manejo de datos y operaciones.",
  "hobbies-history-title": "Historia universal",
  "hobbies-history-description": "La historia universal, historia del mundo, historia mundial o historia de la humanidad es el conjunto de hechos y procesos que se han desarrollado en torno al ser humano, desde su aparición hasta la actualidad.",
  "hobbies-reading-title": "Lectura",
  "hobbies-reading-description": "La lectura es un proceso en el que un individuo conoce cierta información mediante el lenguaje visual o escrito.",
  "hobbies-investigation-title": "Investigacion",
  "hobbies-investigation-description": "Se entiende por investigación un conjunto de actividades humanas destinadas a la obtención de nuevos saberes y conocimientos, y/o su aplicación a la resolución de problemas concretos o interrogantes existenciales."
}
